magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_createInvoice_optional_setCartCustomerAddress.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:urn="urn:Magento" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
	<soapenv:Header />
	<soapenv:Body>
		<urn:shoppingCartCustomerAddresses soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
			<quoteId xsi:type="xsd:int">%s(createInvoiceOptionalQuoteId)</quoteId>
			<customer xsi:type="urn:shoppingCartCustomerAddressEntityArray" soapenc:arrayType="urn:shoppingCartCustomerAddressEntity[]">
				<shoppingCartCustomerAddressEntity>
					<mode>billing</mode>
					<firstname>FirstName</firstname>
					<lastname>SecondName</lastname>
					<street>Street3</street>
					<postcode>85698</postcode>
					<city>Colombo</city>
					<telephone>94785425336</telephone>
					<country_id>LK</country_id>
					<region>Colombo3</region>
				</shoppingCartCustomerAddressEntity>
				<shoppingCartCustomerAddressEntity>
					<mode>shipping</mode>
					<firstname>FirstName1</firstname>
					<lastname>LastName1</lastname>
					<company>WSO2</company>
					<street>Main Street1</street>
					<city>Colombo1</city>
					<region>Western1</region>
					<region_id>12</region_id>
					<postcode>2222</postcode>
					<country_id>LK</country_id>
					<telephone>011-3556678</telephone>
					<fax>24255553</fax>
					<is_default_billing>0</is_default_billing>
					<is_default_shipping>1</is_default_shipping>
				</shoppingCartCustomerAddressEntity>
			</customer>
			<storeId xsi:type="xsd:string">%s(storeId)</storeId>
		</urn:shoppingCartCustomerAddresses>
	</soapenv:Body>
</soapenv:Envelope>